app/controllers/home_controller.rb

  def top
    @todos = Todo.all()
---
SELECT "todos".* FROM "todos"

  def register
    todo = Todo.new(content:params[:content])
    todo.save
---
INSERT INTO "todos" ("content", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["content", "ああ"], ["created_at", "2025-03-06 21:03:42.783840"], ["updated_at", "2025-03-06 21:03:42.783840"]]